<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"2c7c427f60ee29c069990e6eeaf2f8750ca9d428de1c87ceba2914cc47cf23a8","plan_job_ref":"Job Plan org changes and list them in a PR #81 at https://github.com/django-commons/membership/actions/runs/14538103012","plan_out_hash":"ebb28f34339c930d35bcba0f9dbb9a670a28af2fe19ea0367f04693e6ab5b392","plan_hash":"8f291bc707acd9c8cb897400a04dce247a7d0c2d930e3198470900a4eb14c15e","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform__
With var files: `terraform/production/org.tfvars
terraform/production/repositories.tfvars
`
With variables: `github_token = (sensitive value)`
<details>
<summary>Plan: 2 to import, 12 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # github_membership.this["anthonyhashemi"] will be created
+   resource "github_membership" "this" {
+       downgrade_on_destroy = false
+       etag                 = (known after apply)
+       id                   = (known after apply)
+       role                 = "member"
+       username             = "anthonyhashemi"
    }

  # github_repository.this["django-enum"] will be updated in-place
  # (imported from "django-enum")
!~  resource "github_repository" "this" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
!~      allow_update_branch         = false -> true
+       archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
!~      delete_branch_on_merge      = false -> true
        description                 = "Full and natural support for enumerations as Django model fields."
        etag                        = "W/\"256763d75a20763d32c2a5f28b7fb84d2584614b34e167d4ea9f2764686058e7\""
        full_name                   = "django-commons/django-enum"
        git_clone_url               = "git://github.com/django-commons/django-enum.git"
        has_discussions             = true
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
!~      has_wiki                    = true -> false
-       homepage_url                = "https://django-enum.rtfd.io" -> null
        html_url                    = "https://github.com/django-commons/django-enum"
        http_clone_url              = "https://github.com/django-commons/django-enum.git"
        id                          = "django-enum"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "django-enum"
        node_id                     = "************"
        primary_language            = "Python"
        private                     = false
        repo_id                     = 514896521
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:django-commons/django-enum.git"
        svn_url                     = "https://github.com/django-commons/django-enum"
        topics                      = [
            "bitfield",
            "bitfields",
            "bitmask",
            "database",
            "databases",
            "defines",
            "django",
            "enum",
            "enumeration",
            "enums",
            "fields",
            "flag",
            "flags",
            "mask",
            "modelfields",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository_collaborators.this["django-enum"] will be updated in-place
  # (imported from "django-enum")
!~  resource "github_repository_collaborators" "this" {
        id             = "django-enum"
!~      invitation_ids = {} -> (known after apply)
        repository     = "django-enum"

        team {
            permission = "pull"
            team_id    = "*************"
        }
+       team {
+           permission = "admin"
+           team_id    = (known after apply)
        }
+       team {
+           permission = "maintain"
+           team_id    = (known after apply)
        }
+       team {
+           permission = "triage"
+           team_id    = (known after apply)
        }

-       user {
-           permission = "push" -> null
-           username   = "bckohan" -> null
        }
    }

  # github_repository_environment.pypi["django-enum"] will be created
+   resource "github_repository_environment" "pypi" {
+       can_admins_bypass   = true
+       environment         = "pypi"
+       id                  = (known after apply)
+       prevent_self_review = false
+       repository          = "django-enum"

+       reviewers {
+           teams = (known after apply)
        }
    }

  # github_repository_environment.testpypi["django-enum"] will be created
+   resource "github_repository_environment" "testpypi" {
+       can_admins_bypass   = true
+       environment         = "testpypi"
+       id                  = (known after apply)
+       prevent_self_review = false
+       repository          = "django-enum"
    }

  # github_team.repo_admin_team["django-enum"] will be created
+   resource "github_team" "repo_admin_team" {
+       create_default_maintainer = false
+       description               = "Admin team for the django-enum repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "django-enum-admins"
+       node_id                   = (known after apply)
+       parent_team_id            = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team.repo_committer_team["django-enum"] will be created
+   resource "github_team" "repo_committer_team" {
+       create_default_maintainer = false
+       description               = "Committers team for the django-enum repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "django-enum-committers"
+       node_id                   = (known after apply)
+       parent_team_id            = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team.repo_team["django-enum"] will be created
+   resource "github_team" "repo_team" {
+       create_default_maintainer = false
+       description               = "Main team for the django-enum repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "django-enum"
+       node_id                   = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team_members.repo_admin_members["django-enum"] will be created
+   resource "github_team_members" "repo_admin_members" {
+       id      = (known after apply)
+       team_id = (known after apply)

+       members {
+           role     = "member"
+           username = "bckohan"
        }
    }

  # github_team_members.repo_team_members["django-enum"] will be created
+   resource "github_team_members" "repo_team_members" {
+       id      = (known after apply)
+       team_id = (known after apply)

+       members {
+           role     = "member"
+           username = "bckohan"
        }
    }

  # github_team_repository.repo_admin_team_access["django-enum"] will be created
+   resource "github_team_repository" "repo_admin_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "admin"
+       repository = "django-enum"
+       team_id    = (known after apply)
    }

  # github_team_repository.repo_committer_team_access["django-enum"] will be created
+   resource "github_team_repository" "repo_committer_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "maintain"
+       repository = "django-enum"
+       team_id    = (known after apply)
    }

  # github_team_repository.repo_team_access["django-enum"] will be created
+   resource "github_team_repository" "repo_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "triage"
+       repository = "django-enum"
+       team_id    = (known after apply)
    }

  # github_team_settings.this["django-enum"] will be created
+   resource "github_team_settings" "this" {
+       id        = (known after apply)
+       team_id   = (known after apply)
+       team_slug = (known after apply)
+       team_uid  = (known after apply)

+       review_request_delegation {
+           algorithm    = "LOAD_BALANCE"
+           member_count = 2
+           notify       = false
        }
    }

Plan: 2 to import, 12 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan org changes and list them in a PR #81](https://github.com/django-commons/membership/actions/runs/14538103012)